
# YOLOv5n modified for 64x64 grayscale
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple

anchors:
  - [4,5, 8,10, 13,16]  # P3/8
  - [23,29, 43,55, 73,105]  # P4/16

backbone:
  [[-1, 1, Conv, [32, 3, 2, 1]],  # 0-P1/2
   [-1, 1, Conv, [64, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [64]],
   [-1, 1, Conv, [128, 3, 2]],  # 3-P3/8
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 5-P4/16
   [-1, 3, C3, [256]],
   [-1, 1, SPPF, [256, 5]],  # 7
  ]

head:
  [[-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [128, False]],  # 11

   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 6], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [256, False]],  # 14 (P4/16)

   [[11, 14], 1, Detect, [nc, anchors]],  # Detect(P3, P4)
  ]
